import { clsx, type ClassValue } from "clsx";
import { twMerge } from "tailwind-merge";

export function cn(...inputs: ClassValue[]) {
  return twMerge(clsx(inputs));
}

export const blue_colors = `bg-gradient-to-r from-blue-50 to-blue-200`;
export const courses = [
  {
    id: "1",
    title: "جلسات صعوبات التعلم",
    old_price: "EGP 150.00",
    price: "EGP 75.00 ",
    description: "ابنك مدوخ في المذكره ومش بيعرف يقرأ كويس الحل عندنا",
    age: "2–5 سنوات",
    time: "5 ظهراً – 1 مساءا",
    capacity: "10 أطفال",
    image: "/images/course01.jpg",
    // image: "/images/math.webp",
  },
  {
    id: "2",
    title: "رعاية نهارية",
    old_price: "EGP 100.00",
    price: "EGP 150.00 ",
    description: `
    ليه الرعاية النهارية مهمة لاطفالنا؟ 🤔
    `,
    full_description: `

ليه الرعاية النهارية مهمة لاطفالنا؟🤔
ومين الأطفال المناسب ليهم الرعاية النهارية ؟؟؟

لو ابنى عنده اي مشكلة معطلة عن التواصل والتفاعل الاجتماعي
زاي ( اضطراب التوحد او اعاقه عقليه أو فرط حركة أو متأخر فى الكلام أو متلازمة داون او مشكلات الاكاديمية زاي صعوبات التعلم والتاخر الدراسي ....

💥 الرعاية النهارية : 
بيقدم فيها الأخصائيين مساعدة خاصة للطفل لتطوير قدراته اللغوية والمعرفية والسلوكية وتنميه مهارات بشكل فردي ولكن بشكل مكثف وعدد ساعات اكتر
✅ طيب ليه بنقول لولي الأمر الرعايه أفضل لطفلك..؟
👈 لأنها بتوفر بيئة مشابهة للبيت بحيث أن الطفل بيقعد أطول فترة ممكنة فى الاكاديمية وبالتالي بتكون النتيجة أفضل و ملاحظة الطفل بشكل أكثر دقه والتعامل مع السلوكيات فى وقتها. 
👈 ثانيا :تتيح الدمج للأطفال اللي محتاجة الدمج  وطبعا ده بيفرق جدا مع الطفل أنه يلاقي أطفال من سنه معاه وبالتالي التفاعل بيكون افضل 
👈ثالثا  بنوفر علاج طبيعي  للاطفال اللي عندها مشكلة ف الحركة واستشارة دورية لاطفالنا 
الرعاية النهارية شئ مشابه للحضانة بس بمستوى اعلي  وزيادة عليها  الآتي:-

جلسات  التخاطب
             وتنمية المهارات 
                      وتعديل السلوك
                                      الأكاديمي
                                           علاج وظيفي 
                                                          سيكوموتر

 
👈 المكان يتميز بالآتي:
-اعداد برامج  مخصصة لكل طفل وتقييمه بشكل دورى
-اخصائين مؤهلين وذو خبره 
-توافر عوامل الامن والسلامه 

👈👬مواعيد الرعايه النهاريه من الساعه٩صباحا  إلي الساعة 2مساء

يوجد لدينا ابونية 🚌 لتوصيل الأطفال بجميع الأماكن بالمحافظة

#للحجز
ابعتولنا رسالة أو كلمونا على الواتساب او فون 📩

 ‏#Kinder_Garden_Acadmey 🎗️🌟

العنوان👈  الإسكندرية طوسون شارع محمد عبده تقاطع شارع ال١٦ مع ال٢٥ خلف مركز الشباب بعد سماره أمام الشارع محل سلطانه العطاره
#للتواصل واتس اب وتلفون 01016466415
01274964520    `,
    age: "4–6 سنوات",
    time: "7 – 7 ظهراً",
    capacity: "8 أطفال",
    image: "/images/course02.jpg",
    // image: "/images/quran-leeson.webp",
  },
  {
    id: "3",
    title: "جلسات تخاطب",
    old_price: "EGP 150.00",
    price: "EGP 75.00 ",
    description: `جلسات التخاطب لزياده اللغه عند الاطفال`,
    age: "2–4 سنوات",
    time: "9 – 11 صباحاً",
    capacity: "15 طفل",
    image: "/images/courses-03.jfif",
  },
  {
    id: "4",
    title: "حضانة صباحية",
    old_price: "EGP 450.00",
    price: "EGP 350.00 ",
    description: `أكاديمية كيندر جاردين للغات🎗️ 
    `,
    full_description: `
أكاديمية كيندر جاردين للغات🎗️ 
لتنمية مهارات الطفل الإبداعية📈 والأبتكارية 🎖️ لزيادة التركيز والانتباة📝 وتحسين الذاكرة العاملة🏆
منتسوري⌛
أكاديمي ✒️
حضانة فترتين صباحية ومسائية 
UC Math ➗ 🧮
تخاطب📍
تنمية مهارات 📥 
صعوبات التعلم 📝
قرآن كريم📖
كورسات تأسيسية📒
رعاية نهارية🧾🦯
#Kinder_Garden_Acadmey 🎗️🌟
العنوان👈  الإسكندرية طوسون شارع محمد عبده تقاطع شارع ال١٦ مع ال٢٥ خلف مركز الشباب بعد سماره أمام الشارع محل سلطانه العطاره
#للتواصل واتس اب وتلفون 01016466415
01274964520
`,
    age: "2–4 سنوات",
    time: "7 – 7 صباحاً",
    capacity: "15 طفل",
    image: "/images/course04.png",
    // image: "/images/drawing.jpg",
  },
  {
    id: "5",
    title: "كورسات وجلسات و دورات تدربية",
    old_price: "EGP 450.00",
    price: "EGP 350.00 ",
    description: `
    خصم 50 ٪ علي أسعار التقييمات اليومية 
    `,
    age: "2–4 سنوات",
    time: "7 – 7 صباحاً",
    capacity: "15 طفل",
    image: "/images/course05.jpg",
    // image: "/images/drawing.jpg",
  },
];
